---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.MeganewtonMeters
source: html/684a6fa1-b62a-d7b8-c627-ee94f570a081.htm
---
# Autodesk.Revit.DB.UnitTypeId.MeganewtonMeters Property

Meganewton meters.

## Syntax (C#)
```csharp
public static ForgeTypeId MeganewtonMeters { get; }
```